openenergymonitor/STM32/Software/Sombrero_CB_STM32mini/Src/main.c
          last_powerFactor[ch] = powerFactor_now[ch];
          calcPower(ch);
          powerFactor_now[ch] = powerFactor;
          pfHunt(ch);

          if (chn->Iclipped) { chn_result->Clipped = true; chn->Iclipped = false; }

          if (ch == 0) { // estimate mains_frequency on a single channel, no need for more.
            mains_frequency = 1.0/(((chn->samplecount * CTn) / chn->cycles) * adc_conversion_time);
          }

          chn_result->Vrms += Vrms;
          chn_result->Irms += Irms;
          chn_result->ApparentPower += apparentPower;
          chn_result->RealPower += realPower;
          chn_result->PowerFactor += powerFactor;
          chn_result->Mains_AC_Cycles += chn->cycles;
          chn_result->SampleCount += chn->samplecount;
          chn_result->Count++;
        }
    }

    // -----------------
    // POSTING SECTION
    // -----------------
    current_millis = HAL_GetTick();
    if (current_millis - previous_millis_course >= posting_interval)
      { // now to take the channel results, average them and post them.
        uint16_t correction = current_millis - previous_millis_course - posting_interval;
        previous_millis_course = current_millis - correction;
        
        if (no_volts_flag) {
          // while (!usart_tx_ready); // force wait while usart Tx finishes.
          sprintf(log_buffer, "No voltage waveform present.\r\n"); // initital write to buffer.
          debug_printf(log_buffer);
          no_volts_flag = false; // reset.
          goto SkipPost;
        }

        for (int ch = 0; ch < CTn; ch++) {
          channel_results_t *chn_result = &channel_results[ch];

          chn_result->Vrms /= chn_result->Count;
          chn_result->Irms /= chn_result->Count;
          chn_result->ApparentPower /= chn_result->Count;
          chn_result->RealPower /= chn_result->Count;
          chn_result->PowerFactor /= chn_result->Count;

          int _ch = ch + 1; // nicer looking channel numbers. First channel starts at 1 instead of 0.
          //if (_ch == 1) { // single channel debug output.
          sprintf(string_buffer, "V%d:%.2lf,I%d:%.3lf,AP%d:%.1lf,RP%d:%.1lf,PF%d:%.6lf,Joules%d:%.3lf,Clip%d:%d,cycles%d:%d,samples%d:%ld,\r\n",
                                _ch, chn_result->Vrms, _ch, chn_result->Irms, _ch, chn_result->ApparentPower, 
                                _ch, chn_result->RealPower, _ch, chn_result->PowerFactor, 
                                _ch, Ws_accumulator[ch], _ch, chn_result->Clipped, 
                                _ch, chn_result->Mains_AC_Cycles, _ch, chn_result->SampleCount);
          strcat(log_buffer, string_buffer);
          //} // single channel debug output
          chn_result->Clipped = false;
        }

        // Main frequency estimate.
        sprintf(string_buffer, "Hz:%.2f,", mains_frequency);
        strcat(log_buffer, string_buffer);
        
        // Millis
        sprintf(string_buffer, "millis:%ld,", current_millis);
        strcat(log_buffer, string_buffer);
        
        // Pulsecounters
        sprintf(string_buffer, "PC:%ld,", pulseCount);
        strcat(log_buffer, string_buffer);
        // sprintf(string_buffer, "PC2:%ld,", pulseCount2);
        // strcat(log_buffer, string_buffer);

        // has the adc buffer overrun?
        sprintf(string_buffer, "buffOverrun:%d", adc_buffer_overflow);
        adc_buffer_overflow = 0; // reset
        strcat(log_buffer, string_buffer);

        // close the string and add some whitespace for clarity.
        // if (!rpi_connected) { strcat(log_buffer, "}"); }
        // strcat(log_buffer, "\r\n");
        // debug_printf(log_buffer);

        // // RFM69 send.
        // if (radioSender) // sending data, test data only.
        // {
        //   radioData.nodeId = nodeID;
        //   radioData.uptime = HAL_GetTick();
        //   if(ledBlink) { HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, 1); HAL_TIM_Base_Start_IT(&htim16); }// LED blink
        //   RFM69_send(toAddress, (const void *)(&radioData), sizeof(radioData), requestACK);
        //   while (!usart_tx_ready); // force wait while usart Tx finishes.
        //   debug_printf("radio Tx\r\n");
        //   //RFM69_sendWithRetry(toAddress, (const void *)(&radioData), sizeof(radioData), 3,20);
        // }

        SkipPost:
        // reset accumulators.
        for (int ch = 0; ch < CTn; ch++) {
                channel_results_t *chn_result = &channel_results[ch];
                memset((void*)chn_result, 0, sizeof(channel_results_t));
        }
        
        
        // if(ledBlink) {HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET); }

      }// EndJump: // end main readings_ready function.
    
    // end main readings_ready functions.
    // end main readings_ready functions.
    // end main readings_ready functions.

    // if (readings_ready)
    // {
    //   readings_ready = false;
    //   time2 = time1;
    //   time1 = HAL_GetTick();
    //   time_diff = time1 - time2;
    //   for (int n = 0; n < NUMBER_OF_CHANNELS; n++)
    //   {
    //     channel_t *chn = &channels_copy[n];

    //     float Vmean = chn->sum_V / (float)chn->count;
    //     float Imean = chn->sum_I / (float)chn->count;

    //     chn->sum_V_sq /= (float)chn->count;
    //     chn->sum_V_sq -= (Vmean * Vmean); // offset subtraction

    //     if (chn->sum_V_sq < 0) // if offset removal cause a negative number,
    //       chn->sum_V_sq = 0;   // make it 0 to avoid a nan at sqrt.

    //     float Vrms = V_RATIO * sqrtf((float)chn->sum_V_sq);

    //     chn->sum_I_sq /= (float)chn->count;
    //     chn->sum_I_sq -= (Imean * Imean);

    //     if (chn->sum_I_sq < 0)
    //       chn->sum_I_sq = 0;

    //     float Irms = I_RATIO * sqrtf((float)chn->sum_I_sq);

    //     float mean_P = (chn->sum_P / (float)chn->count) - (Vmean * Imean);
    //     float realPower = V_RATIO * I_RATIO * mean_P;

    //     float apparentPower = Vrms * Irms;

    //     float powerFactor;
    //     if (apparentPower != 0) // prevents 'inf' at division
    //     {
    //       powerFactor = realPower / apparentPower;
    //     }
    //     else
    //       powerFactor = 0;

    //     Ws_acc[n] += ((float)(time_diff / 1000.0)) * realPower; // Watt second accumulator.
    //     float Wh_acc = Ws_acc[n] / 3600.0;                      // Wh_acc
    //     float frequency = 250.0 / (float)(time_diff / 1000.0);    // Hz

    //     int _n = n + 1; // for nicer serial print out
    //     sprintf(log_buffer, "V%d:%.2f,I%d:%.3f,RP%d:%.1f,AP%d:%.1f,PF%d:%.3f,Wh%d:%.3f,Hz%d:%.2f,C%d:%ld", _n, Vrms, _n, Irms, _n, realPower, _n, apparentPower, _n, powerFactor, _n, Wh_acc, _n, frequency, _n, chn->count);
    //     debug_printf(log_buffer);
    //   }

    //   debug_printf("\r\n");

